Tekla.Structures.Plugins.DirectManipulation.Services.Controls.DropDownListControl
The Tekla.Structures.Plugins.DirectManipulation.Services.Controls.DropDownListControl class represents a control that allows the user to select
a single item from a list that is displayed when the user clicks the control.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.DropDownListControl.internalControl
The internal control.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.DropDownListControl.#ctor
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Controls.DropDownListControl class.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.DropDownListControl.#ctor(System.Collections.Generic.IEnumerable{System.Object})
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Controls.DropDownListControl class.
items: The items.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.DropDownListControl.#ctor(System.Collections.Generic.IEnumerable{System.Object},System.Object)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Controls.DropDownListControl class.
items: The items.
selectedItem: The selected item.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.DropDownListControl.StateChanged
Event to be called when the state of the control has changed.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.DropDownListControl.Items
Gets the items.
The items.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.DropDownListControl.SelectedItem
Gets or sets the selected item.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.DropDownListControl.InternalControl


Tekla.Structures.Plugins.DirectManipulation.Services.Controls.DropDownListControl.AddItem(System.Object)
Adds an item to the list of items to choose from.
item: The item.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.DropDownListControl.Dispose(System.Boolean)


Tekla.Structures.Plugins.DirectManipulation.Services.Controls.DropDownListControl.OnStateChanged(Tekla.BIM.DirectManipulation.Services.Controls.ControlBase)
Event handler for routing the state changed event.
control: The control.